# Используем легковесный официальный образ Python
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
# Флаг --no-cache-dir не сохраняет кэш скачанных пакетов, чтобы образ был еще легче
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в контейнер
COPY . .

# Команда, которая будет выполняться при старте контейнера (запускаем в режиме лупа)
CMD ["python", "los_terminator.py", "--loop"]
